; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v8 - type_3 ?v1 - type_2)
 	      (pred_3 ?v4 - object ?v1 - type_2)
	      (pred_1 ?v8 - type_3 ?v5 - type_1)
	      (pred_4 ?v8 - type_3 ?v4 - object ?v5 - type_1))

   (:action op_3
       :parameters  (?v8 - type_3 ?v3 ?v6 - type_2)
       :precondition (and  (pred_2 ?v8 ?v3))
       :effect (and  (pred_2 ?v8 ?v6)
		     (not (pred_2 ?v8 ?v3))))

   (:action op_1
       :parameters (?v8 - type_3 ?v7 - object ?v2 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v7 ?v2) (pred_2 ?v8 ?v2) (pred_1 ?v8 ?v5))
       :effect (and (pred_4 ?v8 ?v7 ?v5)
		    (not (pred_3 ?v7 ?v2)) 
		    (not (pred_1 ?v8 ?v5))))

   (:action op_2
       :parameters (?v8 - type_3 ?v7 - object ?v2 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_4 ?v8 ?v7 ?v5) (pred_2 ?v8 ?v2))
       :effect (and (pred_3 ?v7 ?v2)
		    (pred_1 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v7 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_06 - type_3
obj_01 obj_13 obj_04 obj_07 - type_1
obj_09 obj_02 obj_08 obj_11 - type_2
obj_12 obj_05 obj_03 - object)
(:init
(pred_2 obj_10 obj_08)
(pred_1 obj_10 obj_01)
(pred_1 obj_10 obj_13)
(pred_2 obj_06 obj_02)
(pred_1 obj_06 obj_04)
(pred_1 obj_06 obj_07)
(pred_3 obj_12 obj_08)
(pred_3 obj_05 obj_08)
(pred_3 obj_03 obj_11)
)
(:goal
(and
(pred_3 obj_12 obj_08)
(pred_3 obj_05 obj_11)
(pred_3 obj_03 obj_11)
)
)

(:constraints
  (always (not (pred_2 obj_10 obj_11)))
)
)

; plan
1. (op_3 obj_06 obj_02 obj_08)
   deleted: (pred_2 obj_06 obj_02)
   added: (pred_2 obj_06 obj_08)
   goals met: 2 of 3
2. (op_1 obj_06 obj_05 obj_08 obj_07)
   deleted: (pred_3 obj_05 obj_08) (pred_1 obj_06 obj_07)
   added: (pred_4 obj_06 obj_05 obj_07)
   goals met: 2 of 3
3. (op_3 obj_06 obj_08 obj_11)
   deleted: (pred_2 obj_06 obj_08)
   added: (pred_2 obj_06 obj_11)
   goals met: 2 of 3
4. (op_2 obj_06 obj_05 obj_11 obj_07)
   deleted: (pred_4 obj_06 obj_05 obj_07)
   added: (pred_3 obj_05 obj_11) (pred_1 obj_06 obj_07)
   goals met: 3 of 3
